Tyr/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          500;
        startFace       150500;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       151000;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          250;
        startFace       151400;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1250;
        startFace       151650;
    }
    obstacle
    {
        type            patch;
        nFaces          1100;
        startFace       152900;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10500;
        startFace       154000;
    }
)

// ************************************************************************* //
